<h4>Perform the variable encoding on the following type of data.</h4>
    <ol><li>Categorical</li></ol>
    
<h4>1.What is the encoding categorical?</h4>
    <p>-Encoding categorical data is a process of converting categorical data into integer format so that the 
    data with converted categorical values can be provided to the models to give and improve the predictions.</p>

In [10]:
import pandas as pd
import numpy as np

In [5]:
data1 = pd.read_excel('MOVIE.xlsx')

In [6]:
data1

   S.no         Name  rating
0      1        DDLJ  5 star
1      2         War  4 star
2      3      Pathan  3 star
3      4  Home Alone  3 star
4      5   Avengers   5 star
5      6  Spider Man  4 star
6      7       Tiger  3 star
7      8      ABCD 3  2 star

In [123]:
#value_counts():It will count the number of records for every combination of unique values for every column.
data1['rating'].value_counts()

3 star    3
5 star    2
4 star    2
2 star    1
Name: rating, dtype: int64

In [124]:
data1.head(3)

   S.no     Name  rating
0      1    DDLJ  5 star
1      2     War  4 star
2      3  Pathan  3 star

In [125]:
data1.head(7)

   S.no         Name  rating
0      1        DDLJ  5 star
1      2         War  4 star
2      3      Pathan  3 star
3      4  Home Alone  3 star
4      5   Avengers   5 star
5      6  Spider Man  4 star
6      7       Tiger  3 star

In [126]:
#type() method returns class type of the argument(object) passed as parameter in (Pandas)Python.
type(data1['rating'])

pandas.core.series.Series

In [127]:
#The 'dtypes' property returns data type of each column in the DataFrame.
data1.dtypes

S.no       int64
Name      object
rating    object
dtype: object

In [19]:
#The 'astype()' method returns a new DataFrame where the data types has been changed to the specified type.
#the astype()method is used to change the data dype 
data1['rating']=data1['rating'].astype('category')
#data.astype('category').dtypes

In [21]:
data1.dtypes

S.no         int64
Name        object
rating    category
dtype: object

In [30]:
#The cat.codes does not execute
#data['rating']=data['rating'].cat.codes
#data['Ratings_new']=data['Ratings'].cat.codes

In [7]:
#encoding = pd.get_dummies(data1,columns=['rating'])
encoding = pd.get_dummies(data1['rating'])
#print(encoding)

In [132]:
encoding

   S.no         Name  rating_category
0      1        DDLJ                1
1      2         War                1
2      3      Pathan                1
3      4  Home Alone                1
4      5   Avengers                 1
5      6  Spider Man                1
6      7       Tiger                1
7      8      ABCD 3                1

In [28]:
''' The get_dummies function is used to convert categorical variables into dummy(0,1) or 
    indicator variables(0,1).A dummy or indicator variable can have a value of 0 or 1.
'''
encoding = pd.get_dummies(data1['Name']).head()

In [29]:
encoding

   ABCD 3  Avengers   DDLJ  Home Alone  Pathan  Spider Man  Tiger  War
0       0          0     1           0       0           0      0    0
1       0          0     0           0       0           0      0    1
2       0          0     0           0       1           0      0    0
3       0          0     0           1       0           0      0    0
4       0          1     0           0       0           0      0    0

In [31]:
#Dictionary
encode={'Ratings':{"1 star":1,
    "2 star":2,
    "3 star":3,
    "4 star":4,
    "5 star":5}
    
}
data = pd.DataFrame(encode)

In [32]:
#Agin replace the datasets
encoded_df=data.replace(encode)

In [33]:
encoded_df

        Ratings
1 star        1
2 star        2
3 star        3
4 star        4
5 star        5

In [138]:
#Example of the replace() method
df = {
"Array_1": [49.50, 70],
"Array_2": [65.1, 49.50]
}

df = pd.DataFrame(df)

print(df.replace(49.50, 60))

   Array_1  Array_2
0     60.0     65.1
1     70.0     60.0

In [143]:
from sklearn.preprocessing import OrdinalEncoder
#Create object of encoder
obj=OrdinalEncoder()
#encode['rate']=obj.fit_transfrom(encode[['Ratings']])
data['encode']=obj.fit_transform(data[['Ratings']])
#data['encode']=obj.fit_transform(data[['Ratings']])

In [144]:
data

        Ratings  encode  encoder
1 star        1     0.0      0.0
2 star        2     1.0      1.0
3 star        3     2.0      2.0
4 star        4     3.0      3.0
5 star        5     4.0      4.0

In [ ]:
'''
Perform the variable encoding on the following type of data.
    b. Ordina  
    
1.What is ordinal encoding?
    Ordinal encoding is a technique to transform categorical features into a numerical format. 

2.Defination of Ordinal Encoding:-
    In ordinal encoding, each unique category value is assigned an integer value.
    For example, “red” is 1, “green” is 2, and “blue” is 3.
'''

In [34]:
from sklearn.preprocessing import OrdinalEncoder

data =([['red'], ['green'], ['blue']])
print(data)

obj=OrdinalEncoder()
result=obj.fit_transform(data)
print(result)

[['red'], ['green'], ['blue']]
[[2.]
 [1.]
 [0.]]

In [35]:
encode={'Ratings':{"1 star":1,
    "2 star":2,
    "3 star":3,
    "4 star":4,
    "5 star":5}
    
}
data = pd.DataFrame(encode)
print(data)

        Ratings
1 star        1
2 star        2
3 star        3
4 star        4
5 star        5

In [37]:
obj = OrdinalEncoder()
result = obj.fit_transform(data)
print(result)

[[0.]
 [1.]
 [2.]
 [3.]
 [4.]]

In [39]:
from sklearn.preprocessing import OrdinalEncoder
#Create object of encoder
obj=OrdinalEncoder()
#encode['rate']=obj.fit_transfrom(encode[['Ratings']])
data['encode']=obj.fit_transform(data[['Ratings']])
#data['encode']=obj.fit_transform(data[['Ratings']])

In [40]:
data

        Ratings  encode
1 star        1     0.0
2 star        2     1.0
3 star        3     2.0
4 star        4     3.0
5 star        5     4.0